class Txt(object):

    PRIVATE_START_MSG = """
Hɪ {},

Hᴇʟʟᴏ ᴛʜᴇʀᴇ! I'ᴍ ᴛʜᴇ Fɪʟᴇ Mᴇᴛᴀᴅᴀᴛᴀ Eᴅɪᴛᴏʀ Bᴏᴛ, ʜᴇʀᴇ ᴛᴏ ʜᴇʟᴘ ʏᴏᴜ ᴍᴀɴᴀɢᴇ ᴀɴᴅ ᴇᴅɪᴛ ʏᴏᴜʀ ғɪʟᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴇғғᴏʀᴛʟᴇssʟʏ. Wɪᴛʜ ᴍʏ ᴀssɪsᴛᴀɴᴄᴇ, ʏᴏᴜ ᴄᴀɴ ᴇᴀsɪʟʏ ᴜᴘᴅᴀᴛᴇ, ᴍᴏᴅɪғʏ, ᴀɴᴅ ᴏʀɢᴀɴɪᴢᴇ ᴛʜᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴏғ ʏᴏᴜʀ ғɪʟᴇs. Wʜᴇᴛʜᴇʀ ɪᴛ's ᴇᴅɪᴛɪɴɢ ᴅᴏᴄᴜᴍᴇɴᴛ ᴘʀᴏᴘᴇʀᴛɪᴇs, ᴀᴅᴅɪɴɢ ᴛᴀɢs, ᴏʀ ᴍᴀɴᴀɢɪɴɢ ᴀᴜᴛʜᴏʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ, I'ᴍ ʜᴇʀᴇ ᴛᴏ sɪᴍᴘʟɪғʏ ᴛʜᴇ ᴘʀᴏᴄᴇss ғᴏʀ ʏᴏᴜ. Jᴜsᴛ sᴇɴᴅ ᴍᴇ ᴛʜᴇ ғɪʟᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴡᴏʀᴋ ᴡɪᴛʜ, ᴀɴᴅ I'ʟʟ ɢᴜɪᴅᴇ ʏᴏᴜ ᴛʜʀᴏᴜɢʜ ᴛʜᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴇᴅɪᴛɪɴɢ ᴏᴘᴛɪᴏɴs. Lᴇᴛ's ɢᴇᴛ sᴛᴀʀᴛᴇᴅ!
"""
    GROUP_START_MSG = """
Hɪ {},

Hᴇʟʟᴏ ᴛʜᴇʀᴇ! I'ᴍ ᴛʜᴇ Fɪʟᴇ Mᴇᴛᴀᴅᴀᴛᴀ Eᴅɪᴛᴏʀ Bᴏᴛ, ʜᴇʀᴇ ᴛᴏ ʜᴇʟᴘ ʏᴏᴜ ᴍᴀɴᴀɢᴇ ᴀɴᴅ ᴇᴅɪᴛ ʏᴏᴜʀ ғɪʟᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴇғғᴏʀᴛʟᴇssʟʏ. Wɪᴛʜ ᴍʏ ᴀssɪsᴛᴀɴᴄᴇ, ʏᴏᴜ ᴄᴀɴ ᴇᴀsɪʟʏ ᴜᴘᴅᴀᴛᴇ, ᴍᴏᴅɪғʏ, ᴀɴᴅ ᴏʀɢᴀɴɪᴢᴇ ᴛʜᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴏғ ʏᴏᴜʀ ғɪʟᴇs. Wʜᴇᴛʜᴇʀ ɪᴛ's ᴇᴅɪᴛɪɴɢ ᴅᴏᴄᴜᴍᴇɴᴛ ᴘʀᴏᴘᴇʀᴛɪᴇs, ᴀᴅᴅɪɴɢ ᴛᴀɢs, ᴏʀ ᴍᴀɴᴀɢɪɴɢ ᴀᴜᴛʜᴏʀ ɪɴғᴏʀᴍᴀᴛɪᴏɴ, I'ᴍ ʜᴇʀᴇ ᴛᴏ sɪᴍᴘʟɪғʏ ᴛʜᴇ ᴘʀᴏᴄᴇss ғᴏʀ ʏᴏᴜ. Jᴜsᴛ sᴇɴᴅ ᴍᴇ ᴛʜᴇ ғɪʟᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴡᴏʀᴋ ᴡɪᴛʜ, ᴀɴᴅ I'ʟʟ ɢᴜɪᴅᴇ ʏᴏᴜ ᴛʜʀᴏᴜɢʜ ᴛʜᴇ ᴍᴇᴛᴀᴅᴀᴛᴀ ᴇᴅɪᴛɪɴɢ ᴏᴘᴛɪᴏɴs. Lᴇᴛ's ɢᴇᴛ sᴛᴀʀᴛᴇᴅ!

❗**Yᴏᴜ ʜᴀsɴ'ᴛ sᴛᴀʀᴛᴇᴅ ᴍᴇ ʏᴇᴛ ᴛᴏ ᴜsᴇ ᴍᴇ ғɪʀsᴛ sᴛᴀʀᴛ ᴍᴇ sᴏ ɪ ᴄᴀɴ ᴡᴏʀᴋ ғʟᴀᴡʟᴇssʟʏ**
"""
    PROGRESS_BAR = """<b>
╭━━━━❰ᴘʀᴏɢʀᴇss ʙᴀʀ❱━➣
┣⪼ 🗃️ Sɪᴢᴇ: {1} | {2}
┣⪼ ⏳️ Dᴏɴᴇ : {0}%
┣⪼ 🚀 Sᴩᴇᴇᴅ: {3}/s
┣⪼ ⏰️ Eᴛᴀ: {4}
╰━━━━━━━━━━━━━━━➣ </b>"""

    SEND_FFMPEG_CODE = """
😔 Pʟᴇᴀsᴇ Bᴜʏ Pʀᴏ Pʟᴀɴ Tᴏ Aᴄᴄᴇss Tʜɪs Fᴇᴀᴛᴜʀᴇ

📥 TO BUY CONT. @Snowball_Official
"""

    
    HELP_MSG = """
Available commands:-

➜ 𝖢𝖮𝖬𝖨𝖭𝖦 𝖲𝖮𝖮𝖭

<b>⦿ Developer:</b> <a href=https://t.me/Snowball_Official>ѕησωвαℓℓ ❄️</a>
"""

    ABOUT_TXT = """<b>╭───────────⍟
├🤖 ᴍy ɴᴀᴍᴇ : @{}
├👨‍💻 Pʀᴏɢʀᴀᴍᴇʀ : <a href=https://t.me/Snowball_Official>𝓢𝓝𝓞𝓦𝓑𝓐𝓛𝓛</a>
├👑 Instagram : <a href=https://www.instagram.com/ritesh6_>C-Insta</a> 
├☃️ ꜰᴏᴜɴᴅᴇʀ ᴏꜰ : <a href=https://t.me/+HzGpLAZXTxoyYTNl>𝖱𝖮𝖮𝖥𝖨𝖵𝖤𝖱𝖲𝖤</a>
├📕 Lɪʙʀᴀʀy : <a href=https://github.com/pyrogram>Pyʀᴏɢʀᴀᴍ</a>
├✏️ Lᴀɴɢᴜᴀɢᴇ: <a href=https://www.python.org>Pyᴛʜᴏɴ 3</a>
├💾 Dᴀᴛᴀ Bᴀꜱᴇ: <a href=https://cloud.mongodb.com>Mᴏɴɢᴏ DB</a>
├🌀 ᴍʏ ꜱᴇʀᴠᴇʀ : <a href=https://dashboard.heroku.com>Heroku</a>
╰───────────────⍟ """
